InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураТерминал</v8:Type>
						<v8:Type>cfg:CatalogRef.Комплектующие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ФункцияПолучитьЦену/Ext/Module.bsl
&НаСервере
функция ПолучитьЦенуНоменклатуры (Дата, Номенклатура) Экспорт
	Отбор = новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура);
	Данные = РегистрыСведений.Цены.ПолучитьПоследнее(Дата,Отбор);
	Возврат Данные.Цена;
	КонецФункции
